---
kind: property
id: P:Autodesk.Revit.DB.MEPSystem.ConnectorManager
zh: 系统
source: html/891c572c-e7de-8593-330d-5afc8aed9e63.htm
---
# Autodesk.Revit.DB.MEPSystem.ConnectorManager Property

**中文**: 系统

Connector manager of the system.

## Syntax (C#)
```csharp
public ConnectorManager ConnectorManager { get; }
```

## Remarks
The connector manager includes connectors which are used to connect with terminal elements and base equipment.